# Найдите среднее квадратичное отклонение случайной величины X, равномерно распределенной на отрезке [-2, 7]

a = -2
b = 7

s = ((b - a) ** 2 / 12) ** (1/2)
print('{:.2f}'.format(s))