# Дана та же генеральная совокупность из задачи №3 со средним арифметическим 50 и дисперсией 9. 
# В скольких стандартных отклонениях лежит вес 56 г?

m = 50
d = 9
s = d ** (1/2)
x = 56

print((x - m) / s)