# Найдите математическое ожидание случайной величины X, равномерно распределенной на отрезке (-3, 3]

a = -3
b = 3

m = (a + b) / 2
print(m)