# Исследовалось влияние препарата на уровень давления пациентов. 
# Сначала измерялось давление до приема препарата, потом через 10 минут и через 30 минут. 
# Есть ли статистически значимые различия?
# 1е измерение до приема препарата: 150, 160, 165, 145, 155
# 2е измерение через 10 минут: 140, 155, 150, 130, 135

# 2 зависимые выборки => Критерий Уилкоксона
import numpy as np
import scipy.stats as stats

x1 = np.array([150, 160, 165, 145, 155])
x2 = np.array([140, 155, 150, 130, 135])


stats.wilcoxon(x1, x2)
print(stats.wilcoxon(x1, x2))  # Статистических различий нет так как pvalue=0.0625 > 0.05

# WilcoxonResult(statistic=0.0, pvalue=0.0625)