# Найдите математическое ожидание случайной величины X, распределенной по биномиальному закону с параметрами n =100, р=0.3.

p = 0.3
n = 100

m = p * n
print(m)