# Средние расходы на обследование одного больного до ознакомления с расходами коллег
# X= np.array([20,17, 14, 42, 50, 62, 8, 49, 81, 54, 48, 55, 56])
# Y= np.array ([20, 26, 1, 24, 1, 47, 15, 7, 65, 9, 21, 36, 30])
# Средние расходы на лечение одного больного до ознакомления с расходами коллег
# X= np.array([ 32, 41, 51, 29, 76, 47, 60, 58, 40, 64, 73, 66, 73])
# Y= np.array ([42, 90, 71, 47, 56, 43, 137, 63, 28, 60, 87, 69, 50])
# Произошли ли изменения на расходы и лечение?

import numpy as np
import scipy.stats as stats

x1 = np.array([20, 17, 14, 42, 50, 62, 8, 49, 81, 54, 48, 55, 56])
x2 = np.array([20, 26, 1, 24, 1, 47, 15, 7, 65, 9, 21, 36, 30])

y1 = np.array([ 32, 41, 51, 29, 76, 47, 60, 58, 40, 64, 73, 66, 73])
y2 = np.array ([42, 90, 71, 47, 56, 43, 137, 63, 28, 60, 87, 69, 50])

stats.wilcoxon(x1, x2)
print(stats.wilcoxon(x1, x2))       # Расходы на исследование изменились так как pvalue=0.009 < 0.01
print(stats.wilcoxon(y1, y2))       # Расходы на исследование не изменились так как pvalue=0.034 < 0.01
